{"question_1": "Does the utterance initiate a conversation or interaction?", "answer_1": "If the utterance starts a conversation or interaction, it falls under the 'Open' category.", "question_2": "Does the utterance respond to a previous statement or question?", "answer_2": "If the utterance responds to a previous statement or question, it falls under the 'React' category.", "question_3": "Does the utterance maintain the ongoing conversation without changing the topic or direction?", "answer_3": "If the utterance maintains the ongoing conversation without changing the topic or direction, it falls under the 'Sustain' category.", "question_to_define_groups": "Does the utterance initiate the conversation or does it respond/maintain the ongoing conversation?", "group_1_label": "The utterance initiates the conversation.", "group_2_label": "The utterance responds to or maintains the ongoing conversation.", "group_1_data": ["Open.Demand", "Open.Give", "Open.Command", "Open.Attend"], "group_2_data": ["React.Rejoinder", "Sustain.Continue", "React.Respond"], "next_split_group_1": {"question_1": "Does the dialog utterance involve a question?", "answer_1": "Yes, if the dialog utterance involves a question, it belongs to the 'Open.Demand' class. No, if it does not involve a question, it could belong to 'Open.Give', 'Open.Command', or 'Open.Attend' classes.", "question_2": "Does the dialog utterance involve providing information or opinion?", "answer_2": "Yes, if the dialog utterance involves providing information or opinion, it belongs to the 'Open.Give' class. No, if it does not involve providing information or opinion, it could belong to 'Open.Demand', 'Open.Command', or 'Open.Attend' classes.", "question_3": "Does the dialog utterance involve a greeting?", "answer_3": "Yes, if the dialog utterance involves a greeting, it belongs to the 'Open.Attend' class. No, if it does not involve a greeting, it could belong to 'Open.Demand', 'Open.Give', or 'Open.Command' classes.", "question_to_define_groups": "Does the dialog utterance involve a direct interaction with the recipient?", "group_1_label": "Yes, the dialog utterance involves a direct interaction with the recipient.", "group_2_label": "No, the dialog utterance does not involve a direct interaction with the recipient.", "group_1_data": ["Open.Demand", "Open.Command"], "group_2_data": ["Open.Give", "Open.Attend"], "next_split_group_1": {"question_1": "Does the dialog utterance involve asking a question?", "answer_1": "Yes, some dialog utterances involve asking a question, particularly those under the 'Open.Demand' label.", "question_2": "Does the dialog utterance involve making a request, invitation, or command?", "answer_2": "Yes, some dialog utterances involve making a request, invitation, or command, particularly those under the 'Open.Command' label.", "question_3": "Are the dialog utterances used to initiate a conversation or interaction?", "answer_3": "Yes, all dialog utterances in this taxonomy are used to initiate a conversation or interaction.", "question_to_define_groups": "Does the dialog utterance involve asking a question or making a request, invitation, or command?", "group_1_label": "Dialog utterances that involve asking a question.", "group_2_label": "Dialog utterances that involve making a request, invitation, or command.", "group_1_data": ["Open.Demand"], "group_2_data": ["Open.Command"]}, "next_split_group_2": {"question_1": "Does the dialog utterance involve providing information or an opinion?", "answer_1": "Yes, it involves providing information or an opinion.", "question_2": "Is the dialog utterance used as a greeting?", "answer_2": "Yes, it is used as a greeting.", "question_3": "Does the dialog utterance occur at the beginning of a conversation?", "answer_3": "Yes, it occurs at the beginning of a conversation.", "question_to_define_groups": "Is the dialog utterance used to provide information or opinion, or is it used as a greeting?", "group_1_label": "The dialog utterance is used to provide information or opinion.", "group_2_label": "The dialog utterance is used as a greeting.", "group_1_data": ["Open.Give"], "group_2_data": ["Open.Attend"]}}, "next_split_group_2": {"question_1": "Does the dialog utterance involve a response to a previous statement or question?", "answer_1": "If the dialog utterance is a response to a previous statement or question, it falls under either 'React.Respond' or 'React.Rejoinder'.", "question_2": "Does the dialog utterance involve a continuation of the speaker's previous topic without any change in the topic?", "answer_2": "If the dialog utterance involves a continuation of the speaker's previous topic without any change, it falls under 'Sustain.Continue'.", "question_3": "Does the dialog utterance involve a question or detailed response to a previous statement or question?", "answer_3": "If the dialog utterance involves a question or detailed response to a previous statement or question, it falls under 'React.Rejoinder'.", "question_to_define_groups": "Does the dialog utterance involve a direct response or continuation of the speaker's previous topic?", "group_1_label": "The dialog utterance involves a direct response to a previous statement or question.", "group_2_label": "The dialog utterance involves a continuation of the speaker's previous topic without any change.", "group_1_data": ["React.Respond", "React.Rejoinder"], "group_2_data": ["Sustain.Continue"], "next_split_group_1": {"question_1": "Does the dialog utterance include a question or detailed explanation?", "answer_1": "If yes, then the utterance can be categorized under 'React.Rejoinder'. If no, then it doesn't fall under this category.", "question_2": "Does the dialog utterance include a positive or negative response to a previous utterance?", "answer_2": "If yes, then the utterance can be categorized under 'React.Respond'. If no, then it doesn't fall under this category.", "question_3": "Is the dialog utterance a response to a previous utterance?", "answer_3": "If yes, then it can be categorized under either 'React.Rejoinder' or 'React.Respond'. If no, then it doesn't fall under these categories.", "question_to_define_groups": "Does the dialog utterance include a question or detailed explanation?", "group_1_label": "Dialog utterances that include a question or detailed explanation", "group_2_label": "Dialog utterances that include a positive or negative response to a previous utterance", "group_1_data": ["React.Rejoinder"], "group_2_data": ["React.Respond"]}}}