{"question_1": "Does the utterance initiate a conversation or topic?", "answer_1": "If the utterance starts a conversation or introduces a new topic, it belongs to the 'Open' category.", "question_2": "Does the utterance respond to a previous statement or action?", "answer_2": "If the utterance is a reaction or response to a previous statement or action, it belongs to the 'React' category.", "question_3": "Does the utterance extend the scope of the conversation or keep it going?", "answer_3": "If the utterance extends the scope of the conversation or keeps it going, it belongs to the 'Sustain' category.", "question_to_define_groups": "Does the utterance initiate or extend the conversation?", "group_1_label": "Utterances that initiate the conversation.", "group_2_label": "Utterances that extend or react to the conversation.", "group_1_data": ["Open"], "group_2_data": ["React", "Sustain"], "next_split_group_2": {"question_1": "Do the utterances initiate a new topic or extend the current one?", "answer_1": "React utterances do not initiate a new topic, they respond to the interlocutor's previous utterance. Sustain utterances extend the same topic or conversation.", "question_2": "Are the utterances in response to a previous statement?", "answer_2": "React utterances are responses to the interlocutor's previous utterance, while Sustain utterances are not necessarily responses, they can be continuations of the speaker's own previous utterance.", "question_3": "Do the utterances maintain the flow of the conversation?", "answer_3": "Both React and Sustain utterances maintain the flow of the conversation, but in different ways. React utterances do so by responding to the interlocutor, while Sustain utterances do so by extending the conversation.", "question_to_define_groups": "Does the utterance respond directly to a previous statement or does it continue the existing conversation?", "group_1_label": "The utterance responds directly to a previous statement.", "group_2_label": "The utterance continues the existing conversation.", "group_1_data": ["React"], "group_2_data": ["Sustain"]}}